FROM node:alpine 
# задает базовый образ, который будет использоваться для построения контейнера.

WORKDIR /time-app 
#устанавливает рабочий каталог

COPY package*.json ./
# копирует файлы package.json и package-lock.json из контекста сборки

RUN npm install
# выполняет команду npm install внутри контейнера

COPY . .
# копирует все файлы из контекста сборки

EXPOSE 5000
# объявляет, что контейнер будет слушать порт 5000

CMD [ "npm", "run", "dev" ]
#  устанавливает команду, которая будет выполнена при запуске контейнера.